astro-build.astro-vscode
bradlc.vscode-tailwindcss
dbaeumer.vscode-eslint
donjayamanne.python-environment-manager
donjayamanne.python-extension-pack
dracula-theme.theme-dracula
ecmel.vscode-html-css
editorconfig.editorconfig
esbenp.prettier-vscode
evondev.indent-rainbow-palettes
formulahendry.auto-rename-tag
GitHub.github-vscode-theme
heybourn.headwind
jock.svg
magicstack.MagicPython
mikey.vscode-fileheader
ms-azuretools.vscode-docker
ms-python.python
ms-python.vscode-pylance
ms-vscode-remote.remote-containers
ms-vscode.js-debug
msjsdiag.vscode-react-native
naumovs.color-highlight
njpwerner.autodocstring
oderwat.indent-rainbow
PKief.material-icon-theme
robinbentley.sass-indented
shd101wyy.markdown-preview-enhanced
streetsidesoftware.code-spell-checker
Tyriar.sort-lines
usernamehw.errorlens
vadym-vorobel.sort-import-regex
vscodevim.vim
VisualStudioExptTeam.vscodeintellicode
vscode-icons-team.vscode-icons
waderyan.gitblame
WallabyJs.quokka-vscode
yzhang.markdown-all-in-one
Zignd.html-css-class-completion
