dbaeumer.vscode-eslint
donjayamanne.python-environment-manager
donjayamanne.python-extension-pack
ecmel.vscode-html-css
GitHub.github-vscode-theme
magicstack.MagicPython
mikey.vscode-fileheader
ms-azuretools.vscode-docker
ms-python.python
ms-python.vscode-pylance
ms-vscode-remote.remote-containers
ms-vscode.js-debug
msjsdiag.vscode-react-native
naumovs.color-highlight
njpwerner.autodocstring
PKief.material-icon-theme
robinbentley.sass-indented
streetsidesoftware.code-spell-checker
Tyriar.sort-lines
vadym-vorobel.sort-import-regex
VisualStudioExptTeam.vscodeintellicode
vscode-icons-team.vscode-icons
WallabyJs.quokka-vscode
Zignd.html-css-class-completion
