# Setup taps
tap 'homebrew/core'
tap 'homebrew/bundle'
tap 'homebrew/cask'
tap 'homebrew/cask-fonts'
tap 'homebrew/cask-versions'
tap 'aws/tap'
tap 'heroku/brew'

# Formulae
brew 'awscli'
brew 'awsebcli'
brew 'aws-sam-cli'  # Upgrade to 1.98.0 caused issues, new set of commands which breaks Steg.AI deployment script.
brew 'cmake'
brew 'direnv'
brew 'dive' # Docker image explorer
brew 'dvc'
brew 'fd'
brew 'ffmpeg'
brew 'fzf'
brew 'gcc'
brew 'go'
brew 'heroku'
brew 'jq'
brew 'lua-language-server'
brew 'luarocks'
brew 'neovim', args: ["HEAD"]
brew 'node'
brew 'pngpaste'
brew 'pnpm'
brew 'postgresql'
brew 'python'
brew 'pytorch'
brew 'ripgrep'
brew 'rust'
brew 'rustup-init'
brew 'scipy'
brew 'stow'
brew 'terraform'
brew 'the_silver_searcher'
brew 'vim'
brew 'wget'
brew 'yarn'

# Casks
cask 'adobe-creative-cloud'
cask 'aldente'
cask 'alfred'
cask 'android-sdk'
cask 'android-studio'
cask 'authy'
cask 'bitwarden'
cask 'cursor'
cask 'dbeaver-community'
cask 'docker'
cask 'figma'
cask 'flux'
cask 'font-fira-code'
cask 'font-jetbrains-mono-nerd-font'
cask 'google-chrome'
cask 'google-cloud-sdk'
cask 'google-drive'
cask 'java'
cask 'mysqlworkbench'
cask 'neovide'
cask 'nosql-workbench'
cask 'notion'
cask 'obsidian'
cask 'oversight'
cask 'postman'
cask 'react-native-debugger'
cask 'raycast'
cask 'scroll-reverser'
cask 'slack'
cask 'spectacle'
cask 'spotify'
cask 'svgcleaner'
cask 'ticktick'
cask 'iTerm2'
cask 'tunnelblick'
cask 'visual-studio-code'
cask 'zoom'

